{"title":"Simplifying Web Publishing With TypeTote","body":"<p style=\"margin-top: 0pt; margin-bottom: 0pt;\"><span data-preserver-spaces=\"true\" style=\"margin-top: 0pt; margin-bottom: 0pt;\"><b>Website:<\/b> <a href=\"https:\/\/typetote.com\">https:\/\/typetote.com<\/a><\/span><\/p><p style=\"margin-top: 0pt; margin-bottom: 0pt;\"><span data-preserver-spaces=\"true\" style=\"margin-top: 0pt; margin-bottom: 0pt;\"><br><\/span><\/p><p style=\"margin-top: 0pt; margin-bottom: 0pt;\"><span data-preserver-spaces=\"true\" style=\"margin-top: 0pt; margin-bottom: 0pt;\">TypeTote is an open-source barebone flat-file CMS that is flexible for developers and intuitive for writers. Something that started as a side project that eventually evolved into a fully functional content management system.<\/span><\/p><p style=\"margin-top: 0pt; margin-bottom: 0pt;\"><br><\/p><p style=\"margin-top: 0pt; margin-bottom: 0pt;\"><span style=\"margin-top: 0pt; margin-bottom: 0pt;\"><b>The task<\/b>:<\/span><span data-preserver-spaces=\"true\" style=\"margin-top: 0pt; margin-bottom: 0pt;\"> build a simple content management system that was easy to maintain, simple for developers to extend, and easy for people to publish content. <\/span><\/p><p style=\"margin-top: 0pt; margin-bottom: 0pt;\"><br><\/p><p style=\"margin-top: 0pt; margin-bottom: 0pt;\"><span style=\"margin-top: 0pt; margin-bottom: 0pt;\"><b>The challenge:<\/b><\/span><\/p><p style=\"margin-top: 0pt; margin-bottom: 0pt;\"><span data-preserver-spaces=\"true\" style=\"margin-top: 0pt; margin-bottom: 0pt;\">When we first started building websites, it was fun and straightforward. Today, you need to worry about specific coding patterns, learn new APIs, and constantly keep your site up to date with updates and patches. For many, this is something that is more work than it's worth. TypeTote, on the contrary, is a flat-file CMS, it requires no database, and it's easy to extend. <\/span><\/p><p style=\"margin-top: 0pt; margin-bottom: 0pt;\"><br><\/p><p style=\"margin-top: 0pt; margin-bottom: 0pt;\"><span style=\"margin-top: 0pt; margin-bottom: 0pt;\"><b>Our approach:<\/b><\/span><\/p><p style=\"margin-top: 0pt; margin-bottom: 0pt;\"><span data-preserver-spaces=\"true\" style=\"margin-top: 0pt; margin-bottom: 0pt;\">TypeTote is rather unconventional when it comes to how software is built. At its core is a series of basic methods that control how data is created, read, updated, and deleted (CRUD). Since at the end of the day, its sole purpose is to make web publishing easy and enjoyable. With our experience in customizing WordPress and Drupal, we took the best of both worlds. The results? A UX that is simple to set up and a codebase robust and extendable. Unlike other platforms that try to do everything and anything, TypeTote is specific. It's designed for those who want to build a customized website and not worry about maintaining it. Version one was far from perfect, but over time we have been refactoring our code, always looking for ways to make it fast, simple, and easy to use. <\/span><\/p><p style=\"margin-top: 0pt; margin-bottom: 0pt;\"><br><\/p><p style=\"margin-top: 0pt; margin-bottom: 0pt;\"><span style=\"margin-top: 0pt; margin-bottom: 0pt;\"><b>Do you still use Drupal and WordPress?<\/b><\/span><\/p><p style=\"margin-top: 0pt; margin-bottom: 0pt;\"><span data-preserver-spaces=\"true\" style=\"margin-top: 0pt; margin-bottom: 0pt;\">Yes, we actually actively develop for both. It may be counterproductive for a group that touts its own content management system. But that's because TypeTote was built for a specific and general need many people asked about. Our philosophy is that there will never be a single one-fit approach for any task. We pride ourselves on the understanding that each customer's need is different. While we will most certainly use lessons learned from other projects, we will never let that dictate how we approach others. <\/span><\/p><p style=\"margin-top: 0pt; margin-bottom: 0pt;\"><br><\/p><p style=\"margin-top: 0pt; margin-bottom: 0pt;\"><span style=\"margin-top: 0pt; margin-bottom: 0pt;\"><b>The result<\/b><\/span><\/p><p style=\"margin-top: 0pt; margin-bottom: 0pt;\"><span data-preserver-spaces=\"true\" style=\"margin-top: 0pt; margin-bottom: 0pt;\">With TypeTote, we feel we found the right balance between simplicity and customizability when building websites. Allowing developers to develop the way they want while making it really easy for content editors to easily publish content. All the while making it relatively simple for people to keep their sites running and not need to worry about constant maintenance or upkeep. <\/span><\/p>","meta":{"entity_type":"post","category":"work","entity_status":"published","tags":"","featured_image":"https:\/\/confection.dev\/_data\/files\/tt-work.png","path":"work\/simplifying-web-publishing-with-typetote","date_published":"03\/28\/2021","date_edited":"04\/18\/2021","entity_id":"1616897664"},"summary":"Discover the backstory regarding why we built our own CMS, how we designed it, and why we love it so much.","summery":"Website: https:\/\/typetote.comTypeTote is an open-source barebone flat-file CMS that is flexible for developers and intuitive "}